Функция СведенияОВнешнейОбработке() Экспорт
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Наименование", НСтр("ru = 'Выгрузка документов в IIKO'"));
	ПараметрыРегистрации.Вставить("Версия", "0.9");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация", НСтр("ru = 'Выгрузка документов в IIKO'"));
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(ТаблицаКоманд,
		НСтр("ru = 'Выгрузка документов в IIKO'"),
		"ВыгрузкаДокументовВIIKO",
		"ОткрытиеФормы",
		Истина,
		"");
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	Возврат ПараметрыРегистрации;
КонецФункции // СведенияОВнешнейОбработке()

Функция ПолучитьТаблицуКоманд()
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
КонецПроцедуры

Процедура СохранитьНастройки(КлючОбъекта, КлючНастроек, Настройки) Экспорт
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, КлючНастроек, Настройки,, ИмяПользователя());
КонецПроцедуры

Функция ЗагрузитьНастройки(КлючОбъекта, КлючНастроек) Экспорт
	СтруктураНастроек = Неопределено;
    Попытка
        СтруктураНастроек = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта, КлючНастроек,, ИмяПользователя());
    Исключение
        Сообщить("Нет прав на восстановление настроек.");
    КонецПопытки;

    Если СтруктураНастроек = Неопределено Тогда
        Сообщить("Настройки не найдены, будут созданы новые.");
	КонецЕсли;	
	
	Возврат СтруктураНастроек;
КонецФункции

Функция ПолучитьСтрокуПолейПодключения() Экспорт
	Возврат "IikoХост,IikoПорт,IikoЛогин,IikoПароль,СервисХост,СервисПорт,СервисSSL";	
КонецФункции

// 1. Имя таблицы сопоставления (сохранения)
// 2. Имя поля Айко
// 3. Имя поля 1С
// 4. Имя таблицы данных Айко
// Возвращает массив структур
Функция ПолучитьИменаПолейИТаблиц() Экспорт
	ТаблицыПоля = Новый Массив;
	ПоляНастроек = "ТаблицаСопоставления,ТаблицаДанныхАйко,Поле1С,ПолеАйко";
	Данные = "Номенклатура,НоменклатураАйко,Номенклатура1С,НоменклатураАйко;"+
			 "Поставщики,ПоставщикиАйко,Контрагент1С,ПоставщикАйко;"+
			 "Склады,СкладыАйко,Склад1С,СкладАйко";
	Строки = СтрРазделить(Данные, ";");
	Для каждого стр Из Строки Цикл
		эСтр = СтрРазделить(стр, ",");
		ТаблицыПоля.Добавить(Новый Структура(ПоляНастроек, эСтр[0], эСтр[1], эСтр[2], эСтр[3]));
	КонецЦикла;
	Возврат ТаблицыПоля;
КонецФункции

Функция ПолучитьМассивТаблиц(ТаблицыПоля) Экспорт
	Таблицы = Новый Массив;
	Для каждого ТП Из ТаблицыПоля Цикл
		Таблицы.Добавить(ТП.ТаблицаСопоставления);
	КонецЦикла;
	Возврат Таблицы;
КонецФункции