////////////////////////////////////////////////////////////////////////////////
// IZI CLOUD - создание документов IIKO из Бухгалтерии предприятия 3.0 
// Файл: 		демонстрационная внешняя обработка
// Поддержка:   https://izi.cloud/

&НаКлиенте
Процедура ПодключитьсяКIIKO(Команда)
	СохранитьПодключения();
	СтруктураПодключения = ВернутьСтруктуруПодключения(Элементы.ТабПодключения.ТекущаяСтрока);
	СтруктураПодключения.Вставить("Поля", СтрокаПолейПодключения);
	ОткрытьФорму("ВнешняяОбработка.ВыгрузкаДокументовВIIKO.Форма.Форма", СтруктураПодключения, ЭтаФорма);
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Функция ВернутьСтруктуруПодключения(ТС)
	ТПодключение = ТабПодключения.НайтиПоИдентификатору(ТС); 
	СП = Новый Структура(СтрокаПолейПодключения);
	ЗаполнитьЗначенияСвойств(СП, ТПодключение);
	Возврат СП;
КонецФункции

&НаКлиенте
Процедура ДобавитьПодключение(Команда)
	ОткрытьФорму("ВнешняяОбработка.ВыгрузкаДокументовВIIKO.Форма.ФормаНовогоПодключения", , ЭтаФорма);	
КонецПроцедуры

&НаСервере
Процедура СохранитьПодключения()
	Колонки = СтрРазделить(СтрокаПолейПодключения, ",");
	ВрТЗ = Новый ТаблицаЗначений;
	Для каждого Колонка Из Колонки Цикл
		ВрТЗ.Колонки.Добавить(Колонка);
	КонецЦикла;
	Для каждого Подключение Из ТабПодключения Цикл
		сТЗ = ВрТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(сТЗ, Подключение);
	КонецЦикла;
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	ОбъектЗначение.СохранитьНастройки("IziCloudКлиент", "Подключения", ВрТЗ);	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПодключения()
	ТП = ТабПодключения;
	ТП.Очистить();
	Подключения = РеквизитФормыВЗначение("Объект").ЗагрузитьНастройки("IziCloudКлиент", "Подключения");
	Если Подключения <> Неопределено Тогда
		Для каждого Подключение Из Подключения Цикл
			СП = ТП.Добавить();
			ЗаполнитьЗначенияСвойств(СП, Подключение);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СохранитьПодключения();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	СтрокаПолейПодключения = ОбъектЗначение.ПолучитьСтрокуПолейПодключения();
	ЗагрузитьПодключения();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия="НовоеПодключение"  Тогда
        Если ЗначениеЗаполнено(Параметр) Тогда
			СтруктураНП = ПолучитьИзВременногоХранилища(Параметр);
			нПодключение = ТабПодключения.Добавить();
			ЗаполнитьЗначенияСвойств(нПодключение, СтруктураНП);
        КонецЕсли;        
	КонецЕсли;
КонецПроцедуры
