////////////////////////////////////////////////////////////////////////////////
// IZI CLOUD - создание документов IIKO из Бухгалтерии предприятия 3.0 
// Файл: 		демонстрационная внешняя обработка
// Поддержка:   https://izi.cloud/

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТипВыбора = Параметры.ТипВыбора;
	ТЗДанных = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыДанныхАйко);
	Для каждого СтрокаДанных Из ТЗДанных Цикл
		нСтрока = ТабДанныеАйко.Добавить();
		нСтрока.Код = СтрокаДанных[0];
		нСтрока.Наименование = СтрокаДанных[1];
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТабДанныеАйкоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТД = Элементы.ТабДанныеАйко.ТекущиеДанные;
	СтруктураОтвета = Новый Структура("КодАйко, НаименованиеАйко", ТД.Код, ТД.Наименование);
	АдресСтруктурыОтвета = ПоместитьВоВременноеХранилище(СтруктураОтвета);
	Оповестить(ТипВыбора, АдресСтруктурыОтвета);
	ЭтаФорма.Закрыть();
КонецПроцедуры
