////////////////////////////////////////////////////////////////////////////////
// IZI CLOUD - создание документов IIKO из Бухгалтерии предприятия 3.0 
// Файл: 		демонстрационная внешняя обработка
// Поддержка:   https://izi.cloud/

&НаКлиенте
Процедура ДобавитьНовоеПодключение(Команда)
	СтрокаПолейПодключения = "IikoХост,IikoПорт,IikoЛогин,IikoПароль,СервисХост,СервисПорт,СервисSSL";
	СтруктураНовогоПодключения = Новый Структура(СтрокаПолейПодключения);
	ЗаполнитьЗначенияСвойств(СтруктураНовогоПодключения, ЭтаФорма, СтрокаПолейПодключения);
	АдресСтруктурыОтвета = ПоместитьВоВременноеХранилище(СтруктураНовогоПодключения);
	Оповестить("НовоеПодключение", АдресСтруктурыОтвета);
	ЭтаФорма.Закрыть();
КонецПроцедуры
